{
    "data": [
        {
            "name": "project",
            "heading": "Explore My Work",
            "type": "items",
            "action": {
                "name": "openURL",
                "label": "View Live",
                "type": "link"
            },
            "items": [
                {
                    "id": 1,
                    "name": "Menstrual iOS App",
                    "image": "../../assets/media/projects/p0.png",
                    "desc": "A comprehensive menstrual health app designed to support women's health with features like chat system, symptoms tracking, symptoms analyzer, PCOD level analyzer, and symptom summary creator. Built using Firebase Realtime Database and Swift UI Kit.",
                    "tags": [
                        "Mobile Apps",
                        "Swift",
                        "Firebase"
                    ],
                    "technology": "Developed with Swift UI Kit, integrated with Firebase Realtime Database. The app includes cycle monitoring, community support, and tailored health plans.",
                    "challenges": "Analyzing real-life problems faced by women, designing specific solutions, and ensuring accurate data analysis were major challenges.",
                    "url": "https://example.com/sakhi"
                },
                {
                    "id": 2,
                    "name": "Contact Manager",
                    "image": "../../assets/media/projects/p1.png",
                    "desc": "A MERN stack application that manages over 5 million contact entries, featuring blazing-fast search, duplication detection, and CSV import.",
                    "tags": [
                        "Web Apps",
                        "MERN",
                        "Database Management"
                    ],
                    "technology": "Built using MongoDB, Express.js, React, and Node.js, with React Virtualization and Tailwind for the frontend. Features include high-performance data handling and real-time CRUD operations.",
                    "challenges": "Optimizing performance for large datasets and ensuring efficient search and duplicate detection were key challenges.",
                    "url": "https://example.com/contact-manager"
                },
                {
                    "id": 3,
                    "name": "Blog Platform",
                    "image": "../../assets/media/projects/p3.png",
                    "desc": "A dynamic blog platform allowing users to create, share, and comment on posts, built with React and Pure CSS for a responsive experience.",
                    "tags": [
                        "Web Apps",
                        "React",
                        "Dynamic Content"
                    ],
                    "technology": "Developed using React for the frontend and JSON for handling dynamic data. It includes user authentication and a content management system.",
                    "challenges": "Implementing a robust comment moderation system and efficiently managing user-generated content were key challenges.",
                    "url": "https://example.com/blog"
                },
                {
                    "id": 4,
                    "name": "Sorting Visualizer",
                    "image": "../../assets/media/projects/p2.png",
                    "desc": "A MERN stack application that visualizes and compares 5 different sorting algorithms in real-time, with interactive controls and performance tracking for 100+ sorting operations.",
                    "tags": [
                        "Web Apps",
                        "JavaScript",
                        "Algorithms"
                    ],
                    "technology": "Built using the MERN stack to visualize sorting algorithms, providing an interactive educational tool for understanding DSA concepts.",
                    "challenges": "Visualizing algorithm performance in the frontend and handling real-time data were significant challenges.",
                    "url": "https://example.com/sorting-visualizer"
                },
                {
                    "id": 5,
                    "name": "Text Recognizer (OCR)",
                    "image": "../../assets/media/projects/p4.png",
                    "desc": "A Python-based OCR project that uses Tesseract to recognize and extract text from images with high accuracy, even in low-quality images.",
                    "tags": [
                        "Python",
                        "OCR",
                        "Tesseract"
                    ],
                    "technology": "Developed with Python and Tesseract OCR to accurately recognize and extract text from images.",
                    "challenges": "Handling low-quality images and ensuring high accuracy in text recognition were key challenges.",
                    "url": "https://example.com/ocr"
                },
                {
                    "id": 6,
                    "name": "Expense Tracker",
                    "image": "../../assets/media/projects/p1.png",
                    "desc": "A user-friendly expense tracker that helps users manage their finances by tracking income and expenses. Built with React Native and Firebase.",
                    "tags": [
                        "Mobile Apps",
                        "React Native",
                        "Firebase"
                    ],
                    "technology": "Developed using React Native for cross-platform compatibility, integrated with Firebase for data storage and authentication.",
                    "challenges": "Ensuring accurate financial calculations and providing a secure user experience were key challenges.",
                    "url": "https://example.com/expense"
                }
            ]
        }
    ]
}
